{
    "quran": [
      { "verse": "Indeed, Allah is with those who fear Him and those who are doers of good. (16:128)" },
      { "verse": "Verily, with hardship comes ease. (94:6)" },
      { "verse": "And We have certainly created man, and We know what his soul whispers to him. (50:16)" },
      { "verse": "And whoever puts their trust in Allah, He will be sufficient for them. (65:3)" },
      { "verse": "And speak to people kindly. (2:83)" },
      { "verse": "Allah does not burden a soul beyond that it can bear. (2:286)" },
      { "verse": "And We have not sent you, [O Muhammad], except as a mercy to the worlds. (21:107)" },
      { "verse": "Indeed, prayer prohibits immorality and wrongdoing. (29:45)" },
      { "verse": "And whoever fears Allah, He will make for him a way out. (65:2)" },
      { "verse": "Indeed, the Hereafter is better for you than the present [life]. (93:4)" },
      { "verse": "Indeed, the human being is in loss, except those who believe and do good deeds. (103:2-3)" },
      { "verse": "Call upon Me; I will respond to you. (40:60)" },
      { "verse": "And seek help through patience and prayer. (2:45)" },
      { "verse": "And lower your wing to the believers who follow you. (26:215)" },
      { "verse": "Indeed, Allah loves those who are constantly repentant. (2:222)" },
      { "verse": "Do not despair of the mercy of Allah. (39:53)" },
      { "verse": "Indeed, those who have believed and done righteous deeds will have gardens beneath which rivers flow. (2:25)" },
      { "verse": "So remember Me; I will remember you. (2:152)" },
      { "verse": "And do good; indeed, Allah loves the doers of good. (2:195)" },
      { "verse": "Verily, the believers are brothers. (49:10)" },
      { "verse": "Indeed, Allah does not change the condition of a people until they change what is in themselves. (13:11)" },
      { "verse": "Every soul will taste death. (3:185)" },
      { "verse": "And hold firmly to the rope of Allah all together and do not become divided. (3:103)" },
      { "verse": "O you who have believed, fear Allah as He should be feared. (3:102)" },
      { "verse": "And establish prayer and give zakah and bow with those who bow [in worship]. (2:43)" },
      { "verse": "And let not hatred of a people prevent you from being just. (5:8)" },
      { "verse": "Indeed, good deeds do away with misdeeds. (11:114)" },
      { "verse": "Whoever does an atom's weight of good will see it. (99:7)" },
      { "verse": "Whoever does an atom's weight of evil will see it. (99:8)" },
      { "verse": "Indeed, Allah is Forgiving and Merciful. (2:199)" },
      { "verse": "And those who believe and do righteous deeds, We will admit them to gardens beneath which rivers flow. (4:57)" },
      { "verse": "And the Hereafter is better and more enduring. (87:17)" },
      { "verse": "But Allah is the best of planners. (3:54)" },
      { "verse": "Indeed, Allah loves those who rely upon Him. (3:159)" },
      { "verse": "And they planned, but Allah planned. And Allah is the best of planners. (3:54)" },
      { "verse": "Indeed, the prayer at fixed times has been enjoined upon the believers. (4:103)" },
      { "verse": "And establish prayer for My remembrance. (20:14)" },
      { "verse": "And Allah is with the patient. (2:153)" },
      { "verse": "Indeed, Allah loves the doers of good. (3:134)" },
      { "verse": "Indeed, Allah commands you to render trusts to whom they are due. (4:58)" },
      { "verse": "And whoever is guided is only guided for [the benefit of] himself. (27:92)" },
      { "verse": "Indeed, Allah has purchased from the believers their lives and their properties. (9:111)" },
      { "verse": "And whoever saves one life, it is as if he had saved mankind entirely. (5:32)" },
      { "verse": "And do not kill the soul which Allah has forbidden, except by right. (17:33)" },
      { "verse": "And those who strive for Us - We will surely guide them to Our ways. (29:69)" },
      { "verse": "Indeed, Allah does not like transgressors. (5:87)" },
      { "verse": "So race to [all that is] good. (2:148)" },
      { "verse": "And He found you lost and guided [you]. (93:7)" },
      { "verse": "Indeed, mankind was created anxious. (70:19)" }
    ],
    "hadith": [
      { "text": "The best of you are those who learn the Quran and teach it. (Bukhari)" },
      { "text": "Actions are judged by intentions. (Bukhari and Muslim)" },
      { "text": "The strongest among you is the one who controls his anger. (Bukhari)" },
      { "text": "None of you truly believes until he loves for his brother what he loves for himself. (Bukhari)" },
      { "text": "The most beloved of deeds to Allah is that which is continuous, even if it is little. (Bukhari)" },
      { "text": "A good word is charity. (Bukhari)" },
      { "text": "Whoever believes in Allah and the Last Day, let him speak good or remain silent. (Bukhari and Muslim)" },
      { "text": "Paradise lies under the feet of mothers. (Nasa’i)" },
      { "text": "The best among you are those who have the best manners and character. (Bukhari)" },
      { "text": "Allah does not look at your appearance or wealth, but looks at your hearts and deeds. (Muslim)" },
      { "text": "The one who seeks knowledge is on a path to Paradise. (Tirmidhi)" },
      { "text": "The believer is not one who eats his fill while his neighbor goes hungry. (Bukhari)" },
      { "text": "Do not belittle any good deed, even meeting your brother with a cheerful face. (Muslim)" },
      { "text": "The most perfect believer in faith is the one with the best manners. (Tirmidhi)" },
      { "text": "Give glad tidings, and do not scare people away. (Muslim)" },
      { "text": "Whoever removes a hardship of a believer in this world, Allah will remove a hardship from him on the Day of Judgment. (Muslim)" },
      { "text": "When a man dies, his deeds come to an end except for three: an ongoing charity, beneficial knowledge, or a righteous child who prays for him. (Muslim)" },
      { "text": "Kindness is a mark of faith, and whoever is not kind has no faith. (Muslim)" },
      { "text": "The best charity is that given in secret to the poor. (Bukhari)" },
      { "text": "Make things easy for people and do not make them difficult. (Bukhari)" },
      { "text": "Whoever does not show mercy to people, Allah will not show mercy to him. (Muslim)" },
      { "text": "The strong person is not the one who overcomes others by strength, but the one who controls himself in anger. (Bukhari)" },
      { "text": "Smiling in the face of your brother is charity. (Tirmidhi)" },
      { "text": "None of you [truly] believes until I am more beloved to him than his father, his child, and all of mankind. (Bukhari)" },
      { "text": "Seek knowledge from the cradle to the grave. (Bayhaqi)" },
      { "text": "He is not a believer whose stomach is filled while his neighbor goes hungry. (Bukhari)" },
      { "text": "The upper hand is better than the lower hand. (Bukhari)" },
      { "text": "Do not harm others, and do not accept harm. (Ibn Majah)" },
      { "text": "Whoever does not thank people has not thanked Allah. (Tirmidhi)" },
      { "text": "Modesty is a branch of faith. (Muslim)" },
      { "text": "Feed the hungry, visit the sick, and set free the captives. (Bukhari)" },
      { "text": "The one who guides to something good has a reward similar to the doer of it. (Muslim)" },
      { "text": "Whoever is not merciful to people will not be merciful to him by Allah. (Muslim)" },
      { "text": "If you love someone for the sake of Allah, tell them. (Ahmad)" },
      { "text": "He who does not show mercy to our young and respect to our elders is not one of us. (Tirmidhi)" },
      { "text": "The best among you is the one who is best to his family. (Tirmidhi)" },
      { "text": "Wealth is not in having many possessions, but in contentment of the soul. (Bukhari)" },
      { "text": "Do not envy one another; do not hate one another; do not turn away from one another. (Muslim)" },
      { "text": "Allah is gentle and loves gentleness in all matters. (Bukhari)" },
      { "text": "The world is the believer's prison and the disbeliever's paradise. (Muslim)" },
      { "text": "Avoid the seven destructive sins. (Bukhari)" },
      { "text": "Whoever does good deeds, they will be for their own benefit. (Muslim)" },
      { "text": "The one who repents from sin is like one who did not sin. (Tirmidhi)" },
      { "text": "Supplication is the essence of worship. (Tirmidhi)" },
      { "text": "Allah loves those who repent. (Quran 2:222, supporting Hadith)" }
    ]
  }
  